In [1]:
# configuration for root-dir
import os, sys ; ROOT = os.path.dirname(os.getcwd())
sys.path.insert(0, ROOT) if ROOT not in sys.path else None

In [2]:
# import library
import pandas as pd

In [3]:
# read csv file
books = pd.read_csv(os.path.join(ROOT, 'data', 'books.csv'), low_memory=False)
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [4]:
# delete unnecessary columns
column = ['Image-URL-S', 'Image-URL-M', 'Image-URL-L']
books.drop(column, axis=1, inplace=True) 
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [5]:
# rename columns
books.columns = ['isbn', 'title', 'author', 'year_of_publication', 'publisher']
books.head(2)

,isbn,title,author,year_of_publication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [6]:
# get data info
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   isbn                 271360 non-null  object
 1   title                271360 non-null  object
 2   author               271358 non-null  object
 3   year_of_publication  271360 non-null  object
 4   publisher            271358 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB

In [7]:
# find data with null value
books[books.isna().any(axis=1)]

,isbn,title,author,year_of_publication,publisher
118033,0751352497,A+ Quiz Masters:01 Earth,NaN,1999,Dorling Kindersley
128890,193169656X,Tyrant Moon,Elaine Corvidae,2002,NaN
129037,1931696993,Finders Keepers,Linnea Sinclair,2001,NaN
187689,9627982032,The Credit Suisse Guide to Managing Your Perso...,NaN,1995,Edinburgh Financial Publishing

In [8]:
# drop row with null value
books.dropna(inplace=True)
books.info()

<class 'pandas.core.frame.DataFrame'>
Index: 271356 entries, 0 to 271359
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   isbn                 271356 non-null  object
 1   title                271356 non-null  object
 2   author               271356 non-null  object
 3   year_of_publication  271356 non-null  object
 4   publisher            271356 non-null  object
dtypes: object(5)
memory usage: 12.4+ MB

In [9]:
# add description column with null value
books = books.assign(description=pd.NA)
books.head(2)

,isbn,title,author,year_of_publication,publisher,description
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,<NA>
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,<NA>

In [10]:
# save to new file
books.to_csv(os.path.join(ROOT, 'data', 'clean_books.csv'), index=False)
books.to_csv(os.path.join(ROOT, 'data', 'complete_books.csv'), index=False)
books.head(2)

,isbn,title,author,year_of_publication,publisher,description
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,<NA>
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,<NA>